fundraising/test_data/invoice_succeeded.json

{
  "id": "evt_103MXP2kbIgHtIBFeIFqPxp7",
  "created": 1390486769,
  "livemode": false,
  "type": "invoice.payment_succeeded",
  "data": {
    "object": {
      "date": 1390486769,
      "id": "in_103MXP2kbIgHtIBFmaa4U4Xq",
      "period_start": 1390486769,
      "period_end": 1390486769,
      "lines": {
        "object": "list",
        "count": 1,
        "url": "/v1/invoices/in_103MXP2kbIgHtIBFmaa4U4Xq/lines",
        "data": [
          {
            "id": "sub_3MXPaZGXvVZSrS",
            "object": "line_item",
            "type": "subscription",
            "livemode": false,
            "amount": 1000,
            "currency": "usd",
            "proration": false,
            "period": {
              "start": 1390486769,
              "end": 1391091569
            },
            "quantity": 1,
            "plan": {
              "interval": "week",
              "name": "Test $10 Plan",
              "created": 1389926836,
              "amount": 1000,
              "currency": "usd",
              "id": "test_10",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {}
            },
            "description": null,
            "metadata": null
          }
        ]
      },
      "subtotal": 1000,
      "total": 1000,
      "customer": "cus_3MXPY5pvYMWTBf",
      "object": "invoice",
      "attempted": true,
      "closed": true,
      "paid": true,
      "livemode": false,
      "attempt_count": 0,
      "amount_due": 1000,
      "currency": "usd",
      "starting_balance": 0,
      "ending_balance": 0,
      "next_payment_attempt": null,
      "charge": "ch_103MXP2kbIgHtIBF6eblAb1t",
      "discount": null,
      "application_fee": null,
      "subscription": "sub_3MXPaZGXvVZSrS"
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": "iar_3MXPlBDPK90rso"
}
