fundraising/test_data/payment_failed.json

{
  "id": "evt_103Nig2kbIgHtIBFw1zEh0CF",
  "created": 1390759349,
  "livemode": false,
  "type": "invoice.payment_failed",
  "data": {
    "object": {
      "date": 1390755657,
      "id": "in_103Nhg2kbIgHtIBFWGKygiPW",
      "period_start": 1390668828,
      "period_end": 1390755521,
      "lines": {
        "object": "list",
        "count": 1,
        "url": "/v1/invoices/in_103Nhg2kbIgHtIBFWGKygiPW/lines",
        "data": [
          {
            "id": "sub_3NKLRPGIoiUnxe",
            "object": "line_item",
            "type": "subscription",
            "livemode": false,
            "amount": 1000,
            "currency": "usd",
            "proration": false,
            "period": {
              "start": 1390755521,
              "end": 1391360321
            },
            "quantity": 1,
            "plan": {
              "interval": "week",
              "name": "Test $10 Plan",
              "amount": 1000,
              "currency": "usd",
              "id": "test_10",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {}
            },
            "description": null,
            "metadata": null
          }
        ]
      },
      "subtotal": 1000,
      "total": 1000,
      "customer": "cus_3MXPY5pvYMWTBf",
      "object": "invoice",
      "attempted": true,
      "closed": false,
      "paid": false,
      "livemode": false,
      "attempt_count": 1,
      "amount_due": 1000,
      "currency": "usd",
      "starting_balance": 0,
      "ending_balance": 0,
      "next_payment_attempt": 1391018549,
      "charge": "ch_103Nig2kbIgHtIBFLMBGkRCV",
      "discount": null,
      "application_fee": null,
      "subscription": "sub_3MXPaZGXvVZSrS"
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": null
}

