fundraising/test_data/subscription_cancelled.json

{
  "id": "evt_103Nig2kbIgHtIBFu9mfdSuZ",
  "created": 1390759349,
  "livemode": false,
  "type": "customer.subscription.deleted",
  "data": {
    "object": {
      "id": "sub_3MXPaZGXvVZSrS",
      "plan": {
        "interval": "week",
        "name": "Test $10 Plan",
        "amount": 1000,
        "currency": "usd",
        "id": "test_10",
        "object": "plan",
        "livemode": false,
        "interval_count": 1,
        "trial_period_days": null,
        "metadata": {}
      },
      "object": "subscription",
      "start": 1390669124,
      "status": "canceled",
      "customer": "cus_3MXPY5pvYMWTBf",
      "cancel_at_period_end": false,
      "current_period_start": 1390755521,
      "current_period_end": 1391360321,
      "ended_at": null,
      "trial_start": null,
      "trial_end": null,
      "canceled_at": null,
      "quantity": 1,
      "application_fee_percent": null,
      "discount": null
    },
    "previous_attributes": {
      "status": "active"
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": null
}
