fundraising/test_data/zero_invoice_amount.json

{
  "id": "evt_7WUsRYaIlu0Sde",
  "object": "event",
  "api_version": "2015-01-11",
  "created": 1449982465,
  "data": {
    "object": {
      "id": "in_7WUsUQZAaKBS7H",
      "object": "invoice",
      "amount_due": 0,
      "application_fee": null,
      "attempt_count": 0,
      "attempted": true,
      "charge": null,
      "closed": true,
      "currency": "usd",
      "customer": "cus_3MXPY5pvYMWTBf",
      "date": 1449982464,
      "description": null,
      "discount": null,
      "ending_balance": 0,
      "forgiven": false,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "ii_7WUs4wVJ4578O6",
            "object": "line_item",
            "amount": -10000,
            "currency": "usd",
            "description": "Unused time on 100 x Monthly donation after 13 Dec 2015",
            "discountable": false,
            "livemode": true,
            "metadata": {
            },
            "period": {
              "start": 1449982464,
              "end": 1449982464
            },
            "plan": {
              "id": "monthly",
              "object": "plan",
              "amount": 100,
              "created": 1425843036,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": true,
              "metadata": {
              },
              "name": "Monthly donation",
              "statement_descriptor": null,
              "trial_period_days": null
            },
            "proration": true,
            "quantity": 100,
            "subscription": "sub_3MXPaZGXvVZSrS",
            "type": "invoiceitem"
          },
          {
            "id": "sub_3MXPaZGXvVZSrS",
            "object": "line_item",
            "amount": 10000,
            "currency": "usd",
            "description": null,
            "discountable": true,
            "livemode": true,
            "metadata": {
            },
            "period": {
              "start": 1449982464,
              "end": 1481604864
            },
            "plan": {
              "id": "yearly",
              "object": "plan",
              "amount": 100,
              "created": 1425843086,
              "currency": "usd",
              "interval": "year",
              "interval_count": 1,
              "livemode": true,
              "metadata": {
              },
              "name": "Yearly donation",
              "statement_descriptor": null,
              "trial_period_days": null
            },
            "proration": false,
            "quantity": 100,
            "subscription": null,
            "type": "subscription"
          }
        ],
        "has_more": false,
        "total_count": 2,
        "url": "/v1/invoices/in_7WUsUQZAaKBS7H/lines"
      },
      "livemode": true,
      "metadata": {
      },
      "next_payment_attempt": null,
      "paid": true,
      "period_end": 1449982464,
      "period_start": 1449982464,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "subscription": "sub_3MXPaZGXvVZSrS",
      "subtotal": 0,
      "tax": null,
      "tax_percent": null,
      "total": 0,
      "webhooks_delivered_at": null,
      "payment": null
    }
  },
  "livemode": true,
  "pending_webhooks": 1,
  "request": "req_7WUs4zUiIEc77n",
  "type": "invoice.payment_succeeded"
}
